#!/usr/bin/env python3

from .kettle import RedmondKettle


CONF_DEVICE = 'hci0'
CONF_MAC = 'e0:04:66:69:51:fe'
CONF_PASSWORD = '1234567890123456'
CONF_SCAN_INTERVAL = 10


rk = RedmondKettle(mac=CONF_MAC, password=CONF_PASSWORD)
print(rk.onLight(rgb1='27FF00', rgb2='00FFEC', rgb3='000FFF'))


# rk.on()
# rk.onTemperatureToLight()
# rk.onModeHeat(temperature=70)
# sleep(5)
# rk.off()
# rk.onModeBoil()
# sleep(5)
# rk.off()
# rk.onLight()
# sleep(5)
# rk.offLight()

# RedmondKettle.scan()
# bte = RedmondKettleController(CONF_MAC, CONF_PASSWORD)

# Получаем текущий режим работы
# print(bte.auth())
# print(bte.sync())
# print(bte.info())
# print(bte.stat())
# print(bte.RGBLight('boil'))
# print(bte.mode())

# Нагрев до температуры
# print(bte.auth())
# print(bte.sync())
# print(bte.mode())
# print(bte.sendMode(mode='boil', temp=75, howMuchBoil=50))
# print(bte.onMode())
#
# print(bte.onTemperatureToLight())

# Ночник
# print(bte.auth())
# print(bte.sync())
# print(bte.mode())
# print(bte.sendRGBLight('boil', rgb1='eeff00', rgb2='ffbb00', rgb3='ff3c00'))
# print(bte.sendMode(mode='light', temp=75, howMuchBoil=50))
# print(bte.onMode())
# print(bte.offMode())

# Установка цвета для отображения нагрева и запуск чайника
# print(bte.auth())
# print(bte.sync())
# print(bte.mode())
# print(bte.RGBLight('boil'))
# # print(bte.sendRGBLight('boil', rgb1='eeff00', rgb2='ffbb00', rgb3='ff3c00'))
# print(bte.sendRGBLight('boil'))
# print(bte.RGBLight('boil'))
# print(bte.onTemperatureToLight())
# print(bte.onMode())



# Установка цвета для отображения нагрева
# print(bte.onTemperatureToLight())
# print(bte.offTemperatureToLight())
# print(bte.on())
# print(bte.off())
# print(bte.stat())
# print(bte.mode())

# 0  -
# 1  - Номер итерациии / команды
# 2  - Режим команды, выполняемая опция, то что мы хотим что бы сделал чайник
# 3  - Режим работы 00 - boil 01 - heat to temp / нагрев 02 - ? 03 - backlight (boil by default)    temp - in HEX
# 4  -
# 5  - температура, до которой нужно нагревать в режиме работы «нагрев», в режиме кипячения равен 00
# 6  -
# 7  -
# 8  - текущая температура воды (2a=42 по Цельсию)
# 9  - Световая индикация при синхронизации 00 - выключена, 0f (15) - включена
# 11 - статус чайника - 02 - on 00 - off
# 16 - время удержания температуры
#
#   --    --    ??    M     --    T     ??    ??    CT    ++    --    S     --    --    --    --    TE    --    --    --
#   0     1     2     3     4     5     6     7     8     9     10    11    12    13    14    15    16    17    18    19
# ['55', '03', '50', '00', '00', '00', '9d', '02', '00', '00', '00', '00', '00', '00', '00', '00', '00', '00', '00', 'aa']
# ['55', '03', '06', '01', '00', '23', '00', '01', '2c', '0f', '00', '00', '00', '00', '00', '00', '80', '00', '00', 'aa']
# ['55', '03', '06', '00', '00', '00', '00', '01', '2b', '0f', '00', '00', '00', '00', '00', '00', '80', '00', '00', 'aa']
# ['55', '03', '06', '00', '00', '00', '00', '01', '5e', '0f', '00', '00', '00', '00', '00', '00', '80', '00', '00', 'aa']
# ['55', '03', '50', '00', '00', '00', '9e', '02', '00', '00', '00', '00', '00', '00', '00', '00', '00', '00', '00', 'aa']
# ['55', '03', '06', '01', '00', '23', '00', '01', '59', '0f', '00', '00', '00', '00', '00', '00', '80', '00', '00', 'aa']
# ['55', '03', '50', '00', '00', '00', '9e', '02', '00', '00', '00', '00', '00', '00', '00', '00', '00', '00', '00', 'aa']
# ['55', '03', '50', '00', '00', '00', '9e', '02', '00', '00', '00', '00', '00', '00', '00', '00', '00', '00', '00', 'aa']
# ['55', '03', '06', '01', '00', '46', '00', '01', '18', '0f', '00', '00', '00', '00', '00', '00', '80', '00', '00', 'aa'] - выкл
# ['55', '03', '06', '00', '00', '00', '00', '01', '33', '0f', '00', '02', '00', '00', '00', '00', '80', '00', '00', 'aa'] - вкл
# ['55', '03', '06', '00', '00', '00', '00', '01', '58', '0f', '00', '02', '00', '00', '00', '00', '80', '00', '00', 'aa'] - выкл после кипячения
# ['55', '03', '06', '00', '00', '00', '00', '01', '2a', '0f', '00', '00', '00', '00', '00', '00', '80', '00', '00', 'aa'] - посое снеятия и долития
# ['55', '03', '06', '00', '00', '00', '00', '01', '28', '0f', '00', '00', '00', '00', '00', '00', '80', '00', '00', 'aa'] - отжата кнопка свежая вода
# ['55', '03', '06', '02', '00', '23', '00', '01', '28', '0f', '00', '00', '00', '00', '00', '00', '80', '00', '00', 'aa'] - включен нагрев и кипячение
# ['55', '03', '06', '01', '00', '23', '00', '01', '28', '0f', '00', '00', '00', '00', '00', '00', '80', '00', '00', 'aa'] - включен нагрев и выключено кипячение
# ['55', '03', '50', '00', '00', '00', '9f', '02', '00', '00', '00', '00', '00', '00', '00', '00', '00', '00', '00', 'aa'] - нагрев до 80
# ['55', '03', '06', '01', '00', '32', '00', '01', '28', '0f', '00', '00', '00', '00', '00', '00', '80', '00', '00', 'aa'] - нагрев до 50
# ['55', '03', '06', '01', '00', '3c', '00', '01', '27', '0f', '00', '00', '00', '00', '00', '00', '80', '00', '00', 'aa'] - нагрев до 60
# ['55', '03', '06', '01', '00', '46', '00', '01', '27', '0f', '00', '00', '00', '00', '00', '00', '80', '00', '00', 'aa'] - нагрев до 70
#
#
#
#
#